{
  "query": "Creed Aventus",
  "timestamp": "2026-01-22T05:16:48.067Z",
  "totalResults": 57,
  "sourceBreakdown": {
    "reddit": 55,
    "Temptalia": 1,
    "Fragrantica": 1
  },
  "topDupes": [
    {
      "name": "super hyped as an",
      "mentions": 1,
      "sources": [
        "reddit"
      ]
    }
  ],
  "rawData": [
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "2025 Fragrantica community award winners are out.",
      "text": "Best Women's Fragrance 2025 - Amouage Guidance 46 (Runner up: Shalimar L'Essence Guerlain)\n\nBest Men's Fragrance 2025 - Boss Bottle Absolu (Runner up: Creed Absolu Aventus)\n\nBest Unisex Fragrance 2025 - Angel's Share Paradis (Runner up: YSL Babycat)\n\nBest Niche Fragrance 2025 - Ex Nihilo Blue Talisman Extrait de parfum.\n\nBest Dupe Brand - Lataffa.\n\nMen's Favorite Women's Fragrance - PdM Delina\n\nWomen's Favorite men's Fragrance - PdM Althair\n\nThe Sweetest Fragrance for Women 2025 - Kayali Yum Bou",
      "score": 206,
      "comments": 101,
      "url": "https://reddit.com/r/fragrance/comments/1q0xi3o/2025_fragrantica_community_award_winners_are_out/",
      "created": "2026-01-01T06:21:00.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Fragrance you tried that smelled TOO MUCH",
      "text": "Have you ever sampled a fragrance that sounded amazing on paper: the notes you love, hype surrounding it, maybe even a bottle you were excited to own. You hunt down a sample or decant, spray it on with anticipation... and then...**...your soul leaves your body.** Not necessarily because it smells *bad*, but because it's just **TOO. DAMN. MUCH.**\n\nLike, overwhelming. Cloying. Shouting from the rooftops. And suddenly, you're having a full existential crisis in the middle of a department store (or ",
      "score": 70,
      "comments": 152,
      "url": "https://reddit.com/r/fragrance/comments/1ln50r8/fragrance_you_tried_that_smelled_too_much/",
      "created": "2025-06-29T03:33:47.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "\"Clones\" that are better?",
      "text": "What, in your opinion, are some fragrances that are dubbed clones of others but offer better performance and projection?",
      "score": 174,
      "comments": 204,
      "url": "https://reddit.com/r/fragrance/comments/uy5c7m/clones_that_are_better/",
      "created": "2022-05-26T11:21:23.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Fulton &amp; Roark - Discovery Set Thoughts",
      "text": "I recently purchased the discovery set from Fulton &amp; Roark and wanted to share my honest thoughts and opinions on the house. I recently emptied most of my full bottles, scents I’ve been wearing for quite a while, and I’m needing a refresh. I didn’t think F&amp;R would be the house for me, but thought I might find a “freshie” that’s just easy to grab and crowd-please - as my taste is definitely more niche and odd, so I need a few cleaner scents in my collection - and thought this would be a f",
      "score": 11,
      "comments": 21,
      "url": "https://reddit.com/r/fragrance/comments/1ncrv1n/fulton_roark_discovery_set_thoughts/",
      "created": "2025-09-09T19:04:54.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "I just got all these for $300(230usd)…..",
      "text": "https://imgur.com/a/mVtL1Cr\n\nOriginally, the ad had 7 bottles for a total of $500 individually priced, but the seller mentioned taking all for $300. I hopped on the deal because the two PDM’s are worth nearly all of that already. When I arrived, he decided to toss in 5 more bottles, and all those samples free of charge. The samples are filled with gems, which alone must be worth ~ $300… I lucked out today. \n\n**Bottles**\n\nParfums de Marly Layton 70/75ml\n\nParfums de Marly Herod 70/75ml\n\nAll Saints",
      "score": 209,
      "comments": 59,
      "url": "https://reddit.com/r/fragrance/comments/15zum2g/i_just_got_all_these_for_300230usd/",
      "created": "2023-08-24T07:21:43.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "My collection (Super Mid)",
      "text": "[Collection 5/23](https://imgur.com/a/zinZyL6)\n\nHey everyone,Saw some people do this and I thought it would be fun to see this and possibly get some feedback and/or answer questions!!I am also going to add the ones I am still getting shipped to me; I'll add them at the very end.Im going to talk about why I like them, give them my rating based off of everything, and for the memes, put how many compliments I've gotten from them LOL hahaha.\n\n(Row by Row)\n\nRow 1  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\",
      "score": 105,
      "comments": 88,
      "url": "https://reddit.com/r/fragrance/comments/13udc98/my_collection_super_mid/",
      "created": "2023-05-28T22:40:26.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "My Top 8 of All Time",
      "text": "My favorite scents of all time 10 years into collecting and smelling just about everything out there in stores like Neiman Marcus and Saks. As you can see below, I’m a big fan of fresh, aromatic woody/citrus scents. \n\n8. Aventus / Aventus Cologne\n\nThis one probably goes without saying. The Aventus DNA is an inspiration to so many unique fragrances and dupes. And for good reason. \n\n7 and 6. Millesime Imperial &amp; Pure White Cologne (shout out to Silver Mountain Water)\n\nThis scent profile has an",
      "score": 42,
      "comments": 22,
      "url": "https://reddit.com/r/fragrance/comments/1kj2fnv/my_top_8_of_all_time/",
      "created": "2025-05-10T05:01:03.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Fine’ry Alleged &amp; Aqua Venture - REVIEW",
      "text": "[Preface: I’m not good with scent notes just yet, so take this as a layman’s review. I just wanted to write one because I couldn’t find much on this sub about these specific scents and I don’t like r//colognes.]\n\n**Why did I buy these?** I wanted a cologne that smelled nice, but not too strong. I’m taking them to a conference where I will be in close contact with others during panels, so my Creed Aventus was for sure not coming with me. I was also traveling with it, so I wanted to lose less mone",
      "score": 9,
      "comments": 3,
      "url": "https://reddit.com/r/fragrance/comments/1o9xyo6/finery_alleged_aqua_venture_review/",
      "created": "2025-10-18T14:55:49.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "I got my first fragrance",
      "text": "I just got Tom Ford Bitter Peach. I also sprayed oud wood, fucking fabulous, jasmine rogue and some other stuff on my arms. \n\nBP i like it a lot it feels perfect for during the day and also a fragrance I can have that has a bit of feminine touch to it so it stands out compared to other guys. I want to smell more specific and unlike what most guys use (sausage eros invictus 1mil etc). im usually not a vanilla fan but the touch of rum and what I think is wood or powder?   makes it pretty good\n\noud",
      "score": 14,
      "comments": 12,
      "url": "https://reddit.com/r/fragrance/comments/1lbl54t/i_got_my_first_fragrance/",
      "created": "2025-06-14T22:39:47.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Is CDNIM really that good or close to Creed Aventus?",
      "text": "Hi!\n\nI don’t promote clones but I have been hearing a lot about Armaf’s CDNIM. To fragheads who have both, do they really smell similar?\n\nI don’t actually want to spend money on Creed Aventus yet but I want to try out a cheaper alternative.\n\nPlease respect the post. Thanks!",
      "score": 5,
      "comments": 25,
      "url": "https://reddit.com/r/fragrance/comments/llilwr/is_cdnim_really_that_good_or_close_to_creed/",
      "created": "2021-02-17T01:17:02.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Creed Aventus personal review",
      "text": "There is a common quote going by “you get what you pay for in life” which is what I think of creed aventus. Is it expensive? Absolutely it is. Are there alternatives that can provide just as good as a smell for half the price? Absolutely, but they’ll never be aventus. IMO, aventus is worth the money and it’s a fragrance that will make you not want to buy other fragrances for half the cost.\n\nPros about aventus\n\n1. The smell is incredibly unique and distinct from other fragrances\n\n2. It’s long las",
      "score": 7,
      "comments": 22,
      "url": "https://reddit.com/r/fragrance/comments/nymqgr/creed_aventus_personal_review/",
      "created": "2021-06-13T02:27:20.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Creed aventus alternatives",
      "text": "Best Creed aventus alternatives that resemble the smell, notes and longevity?",
      "score": 10,
      "comments": 9,
      "url": "https://reddit.com/r/fragrance/comments/hy7ruw/creed_aventus_alternatives/",
      "created": "2020-07-26T14:24:30.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "6 Fragrance Collection",
      "text": "Choose 6 fragrances using this format for your collection.\n\n1.) *Spring &amp; Summer Daily Driver* (Work and casual daily wear). I choose **Creed Millesime Imperial.**\n\n2.) *Spring &amp; Summer Special Occasion* (For dates and more elevated or dressed up spring and summer occasions). I choose **Creed Aventus Cologne.**\n\n3.)  *Spring &amp; Summer Alternate* (a wild card of sorts you can do whatever you want with). I choose **Creed Virgin Island Water.**\n\n4, 5 and 6 will be the same but for *Fall ",
      "score": 33,
      "comments": 82,
      "url": "https://reddit.com/r/fragrance/comments/1e0sqwn/6_fragrance_collection/",
      "created": "2024-07-11T16:12:59.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "What am I missing or misunderstanding?",
      "text": "\"Your fragrance should be discovered, not announced.\"\n\nThe age-old mantra of this sub. The same mantra I try to stick to since I dove into the world of fragrance. It's the reason why I don't douse myself in cologne - why I only spray myself once a day, with 3 spritzes - one on the neck, and one on each forearm. \n\nThat's why I'm surprised that my coworker \"smelled a blast of cologne\" when I walked through the door to the office and he was 30 ft away. \"It's not bad\" he says. But it probably doesn'",
      "score": 78,
      "comments": 146,
      "url": "https://reddit.com/r/fragrance/comments/yqqbqq/what_am_i_missing_or_misunderstanding/",
      "created": "2022-11-09T17:58:53.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "My 2020 Purchases, 55 fragrances, with mini reviews, best in class and top lists. WARNING: Very long post.",
      "text": "55 fragrances, a little more than one a week. Ranging from bargain bin to seriously overpriced niche. \n\nSome real gems and a few duds. Links to Fragrantica for each fragrance. Here goes:\n\n[27 87 - Genetic Bliss](https://www.fragrantica.com/perfume/27-87/Genetic-Bliss-51396.html)**:** Similar to Eccentric Molecules, but more refined, great depth and great longevity. Perfect for layering.  A worthy purchase. \n\n[Abel - Cobalt Amber](https://www.fragrantica.com/perfume/Abel/Cobalt-Amber-42980.html)*",
      "score": 363,
      "comments": 82,
      "url": "https://reddit.com/r/fragrance/comments/kl8oes/my_2020_purchases_55_fragrances_with_mini_reviews/",
      "created": "2020-12-27T18:33:54.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Recommend me a fragrance thread for the week of 03/11/19",
      "text": "Want to know more about a fragrance or find a cheaper alternative? Want suggestions or guidance about what fragrance to try/buy, or where to buy it?  Is your favorite bottle discontinued or hard to get and you want something like it? This is the place to ask! We have a dedicated group of redditors here who can help you streamline your search. They don't have all the answers, but many are knowledgeable and willing to help. Please be as descriptive as possible with what you are looking for -- the ",
      "score": 13,
      "comments": 256,
      "url": "https://reddit.com/r/fragrance/comments/azpv5j/recommend_me_a_fragrance_thread_for_the_week_of/",
      "created": "2019-03-11T06:10:26.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Spent over 200€ on niche samples...",
      "text": "  \n\nThis thread is meant to share my experience of buying, mostly, niche fragrance samples and what I have learned on the way. Also there will be a load of short reviews of what I have sampled. Bear in mind that I am portuguese and my English isn't the best.\n\nI have been a fragrance enthusiast for the last 8 years but without much commitment and I was exposed mostly to designer and affordable perfumes. The resemblance of trying Creed Aventus for the first time was pure bliss 6 years ago but, eve",
      "score": 165,
      "comments": 45,
      "url": "https://reddit.com/r/fragrance/comments/19fdpb4/spent_over_200_on_niche_samples/",
      "created": "2024-01-25T16:48:04.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "The Seven Deadly Sins of Perfume",
      "text": "We often discuss how fragrance is tied to our emotions and how those emotions influences our objectivity, making every opinion subjective really. With that in mind, as I read the latest \"Best in Show\" article on Fragrantica called The Se7en Sins in Perfume, I thought that this might be a fun exercise for our community to do as well. Why let a rather small group of people define the list, when our large community could do a much better job? :) \n\nNow the purpose here is not to create anger by any ",
      "score": 243,
      "comments": 85,
      "url": "https://reddit.com/r/fragrance/comments/lhibt8/the_seven_deadly_sins_of_perfume/",
      "created": "2021-02-11T10:53:15.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Hyped Fragrances You've Bought But Never Reach For...",
      "text": "https://imgur.com/a/pdFwgdg\n\nWhat are some hyped fragrances you've bought but hardly wear since purchasing?\n\n**Mont Blanc Individuel** would be that fragrance for me.\n\nThis fragrance was SUPER hyped as an alternative to Creed Original Santal. I bought a 3ml sample, really liked it and bought a bottle.\n\nBut to be honest, I used that 3ml sample more than I've used the bottle I bought. **I don't think I've EVER used this stuff, ever, not ONCE, in 3 or 4 YEARS!**\n\nMy wife wore it a couple times to w",
      "score": 53,
      "comments": 149,
      "url": "https://reddit.com/r/fragrance/comments/mcs00s/hyped_fragrances_youve_bought_but_never_reach_for/",
      "created": "2021-03-25T06:45:41.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Noob's review of 20 fragrances sampled over the past 2 months.",
      "text": "Hey r/fragrance, \n\nTo preface this review, I'm still really new to the world of fragrances. I've just started becoming heavily interested in the hobby back in December after spending my entire life ignorant to it, assuming everything either smelled like Axe or a department store fragance aisle. I didn't know that there were so many different types of notes and brands aside from the well-known designer ones. I also wanted to add a final touch to elevate my wardrobe after I gave it a near overhaul",
      "score": 165,
      "comments": 34,
      "url": "https://reddit.com/r/fragrance/comments/1apykn8/noobs_review_of_20_fragrances_sampled_over_the/",
      "created": "2024-02-13T17:07:23.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Fragrance Collection! (Long lol)",
      "text": "**Imgur link:** [https://imgur.com/a/U81F47U](https://imgur.com/a/U81F47U)\n\nHi guys! New to the subreddit and thought I'd share my desk display!\n\nI bought my first fragrance when I was in my first year of university but I would say my collecting habits didn't start until maybe 2.5 years ago (I'm 25,M for reference). Started off with the designers and what not, but then slowly started getting into the niche. I will say there's no rhyme or reason as to what kind of scents/notes I gravitate to - if",
      "score": 32,
      "comments": 21,
      "url": "https://reddit.com/r/fragrance/comments/1iq6yez/fragrance_collection_long_lol/",
      "created": "2025-02-15T17:52:52.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Your partner loves all the fragrances you don’t. What now?",
      "text": "About a year ago, I got into fragrances. Not in a big way, and will never be a collector... just wanted a signature scent. I ordered more samples than I could shake a stick at, and got going. \n\nAmong my favorites: Creed Aventus and Tom Ford Tuscan Leather. My wife’s reaction to Aventus: *gag* “you smell like someone just cleaned a bathroom” and to Tuscan Leather: “old man smell.”\n\nOn the other hand, she went wild when I tried on Mugler A*men Pure Havane and, more recently, Dior Sauvage. I’m not ",
      "score": 104,
      "comments": 96,
      "url": "https://reddit.com/r/fragrance/comments/lo769b/your_partner_loves_all_the_fragrances_you_dont/",
      "created": "2021-02-20T13:30:37.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "My favorite fragrances as a tall dark mysterious man",
      "text": "First of all, I’m not that tall. Nor am I that dark. But I think matching a fragrance to your look and vibe is more important than just wearing a good smelling scent… and that is the best way I can describe my dark and “edgy” alternative look. I’m a tattooed metal head, why would I want to smell like Creed Aventus?  I gravitate towards more wood and spicy scents. I do like amber and the smoothness of vanilla/fig but I shy away from overly sweet scents.\n\nGucci Guilty Pour Homme - my first cologne",
      "score": 26,
      "comments": 39,
      "url": "https://reddit.com/r/fragrance/comments/1dnivw2/my_favorite_fragrances_as_a_tall_dark_mysterious/",
      "created": "2024-06-24T17:16:23.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Pine, spice, and sweet. My [25M] collection after about 5 years + short thoughts.",
      "text": "This is probably the first time in a while I have taken full stock of my bottles and wow I had way more than I thought I did. Oh well, it's a hobby that has made me quite happy over the years. I've grouped them by predominant note or broad grouping (to my nose). Many have come and gone but this is what in my collection at the moment. For the sake of this post, I've only included full bottles and travel sprays (no decants). Feel free to ask any questions! My [full collection is here](https://imgu",
      "score": 105,
      "comments": 41,
      "url": "https://reddit.com/r/fragrance/comments/l2rtw7/pine_spice_and_sweet_my_25m_collection_after/",
      "created": "2021-01-22T16:58:35.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "My [35M] husband’s minimal fragrance collection",
      "text": "[His collection](https://imgur.com/a/rzpv8rY)\n\nI’ve been seeing a lot of posts recently about folks getting sucked into huge collections or spending too much money so I wanted to share my husband’s minimal collection that I’ve bought for him as gifts over the past 15 years. We each only had 1-2 frags in HS and college. We’ve added more recently as we have more income and I’ve gotten more into the hobby but I actively try to limit our collections to just what we love and enjoy sampling.\n\nD&amp;G ",
      "score": 37,
      "comments": 27,
      "url": "https://reddit.com/r/fragrance/comments/tzwyck/my_35m_husbands_minimal_fragrance_collection/",
      "created": "2022-04-09T16:37:49.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "I've never worn cologne, but was interviewing for an executive level position and decided to buy a small bottle of Creed Aventus",
      "text": "Wow...I've never been that much into fragrance but after someone suggested I look into this cologne I can say I know why it's so expensive. I bought one of the small sample sizes with like 20 sprays in it from Amazon. The very fist time I wore it someone commented on it which was really surprising to me because the thought of someone commenting on my smell seems really out of left field to me.\n\n&amp;#x200B;\n\nIt's got a slightly familiar cologne scent with a really toned down fruity scent. It als",
      "score": 20,
      "comments": 53,
      "url": "https://reddit.com/r/fragrance/comments/bp9505/ive_never_worn_cologne_but_was_interviewing_for/",
      "created": "2019-05-16T06:35:02.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Is CDNIM really that good or close to Creed Aventus?",
      "text": "Hi!\n\nI don’t promote clones but I have been hearing a lot about Armaf’s CDNIM. To fragheads who have both, do they really smell similar?\n\nI don’t actually want to spend money on Creed Aventus yet but I want to try out a cheaper alternative.\n\nPlease respect the post. Thanks!",
      "score": 5,
      "comments": 25,
      "url": "https://reddit.com/r/fragrance/comments/llilwr/is_cdnim_really_that_good_or_close_to_creed/",
      "created": "2021-02-17T01:17:02.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Creed Aventus",
      "text": "So for some this is the best men's fragrance you can buy. I've even read some hailing this as King Aventus. What do I think? It's a great smelling fragrance but man is this hype too strong with this scent.\n\nWhen smelt, I immediately pick up on the pineapple, birchwood and black currant. You get a fresh, fruity a mild smokey smell. It's a great combination and you’re not going to smell many people with this scent. This is unique (I'll address the clones later) while being very pleasant. This does",
      "score": 8,
      "comments": 38,
      "url": "https://reddit.com/r/fragrance/comments/731ki7/creed_aventus/",
      "created": "2017-09-28T17:18:08.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Show and Tell for the New Year",
      "text": "[My Collection](https://imgur.com/a/sCHyrGh)\n\n  \nHello folks. \n\nLong time, first time. \n\nI got my first \"non-voyage\", \"non-coolwater\" fragrance in 2020 during the lockdown. \n\nMy Partner (GF at the time) gifted me Dior Sauvage EDP, which was my introduction in to the world of perfumes. Had she known what would ensue in the coming months and years, she'd have let me continue my \"voyage\" unencumbered. \n\nBut here we are, after a couple of thousand dollarydoos spent, below is all of the perfumes from",
      "score": 7,
      "comments": 7,
      "url": "https://reddit.com/r/fragrance/comments/1q3qtd4/show_and_tell_for_the_new_year/",
      "created": "2026-01-04T14:08:28.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Recommend me a fragrance thread for the week of 03/11/19",
      "text": "Want to know more about a fragrance or find a cheaper alternative? Want suggestions or guidance about what fragrance to try/buy, or where to buy it?  Is your favorite bottle discontinued or hard to get and you want something like it? This is the place to ask! We have a dedicated group of redditors here who can help you streamline your search. They don't have all the answers, but many are knowledgeable and willing to help. Please be as descriptive as possible with what you are looking for -- the ",
      "score": 13,
      "comments": 256,
      "url": "https://reddit.com/r/fragrance/comments/azpv5j/recommend_me_a_fragrance_thread_for_the_week_of/",
      "created": "2019-03-11T06:10:26.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "The Seven Deadly Sins of Perfume",
      "text": "We often discuss how fragrance is tied to our emotions and how those emotions influences our objectivity, making every opinion subjective really. With that in mind, as I read the latest \"Best in Show\" article on Fragrantica called The Se7en Sins in Perfume, I thought that this might be a fun exercise for our community to do as well. Why let a rather small group of people define the list, when our large community could do a much better job? :) \n\nNow the purpose here is not to create anger by any ",
      "score": 246,
      "comments": 85,
      "url": "https://reddit.com/r/fragrance/comments/lhibt8/the_seven_deadly_sins_of_perfume/",
      "created": "2021-02-11T10:53:15.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Why are fragrances at Harrod’s priced cheaper?",
      "text": "Harrod’s has some really great prices on niche fragrance houses like Creed, Parfums de Marly and Maison Francis Kurkdjian. \n\nTo put it in perspective, Creed’s Aventus (100ml) is typically $495 in the US, but $330 at Harrod’s. PDM’s Percival (75ml) is typically $260, but $225 at Harrod’s. And MFK’s Baccarat Rouge 540 Extrait (70ml) is usually $475, but $400 at Harrod’s. All of Harrod’s prices being in USD on the website and shipping is a standard $30.\n\nHas anyone in the US bought fragrances from ",
      "score": 32,
      "comments": 31,
      "url": "https://reddit.com/r/fragrance/comments/1ht10u0/why_are_fragrances_at_harrods_priced_cheaper/",
      "created": "2025-01-03T23:58:55.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Fine’ry Alleged &amp; Aqua Venture - REVIEW",
      "text": "[Preface: I’m not good with scent notes just yet, so take this as a layman’s review. I just wanted to write one because I couldn’t find much on this sub about these specific scents and I don’t like r//colognes.]\n\n**Why did I buy these?** I wanted a cologne that smelled nice, but not too strong. I’m taking them to a conference where I will be in close contact with others during panels, so my Creed Aventus was for sure not coming with me. I was also traveling with it, so I wanted to lose less mone",
      "score": 8,
      "comments": 3,
      "url": "https://reddit.com/r/fragrance/comments/1o9xyo6/finery_alleged_aqua_venture_review/",
      "created": "2025-10-18T14:55:49.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Noob's review of 20 fragrances sampled over the past 2 months.",
      "text": "Hey r/fragrance, \n\nTo preface this review, I'm still really new to the world of fragrances. I've just started becoming heavily interested in the hobby back in December after spending my entire life ignorant to it, assuming everything either smelled like Axe or a department store fragance aisle. I didn't know that there were so many different types of notes and brands aside from the well-known designer ones. I also wanted to add a final touch to elevate my wardrobe after I gave it a near overhaul",
      "score": 165,
      "comments": 34,
      "url": "https://reddit.com/r/fragrance/comments/1apykn8/noobs_review_of_20_fragrances_sampled_over_the/",
      "created": "2024-02-13T17:07:23.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Blow thou winter wind: More shitty reviews for your reading pleasure",
      "text": "People seemed to engage with the half-baked reviews I wrote for the test flights I bought last [fall](https://old.reddit.com/r/fragrance/comments/1ae6bgh/legends_of_the_fall_more_shitty_reviews_that/) and [summer](https://old.reddit.com/r/fragrance/comments/16n0tyz/the_bois_of_summer_halfbaked_reviews_from_a/), so here's some more from my [winter flight.](https://i.imgur.com/VfPsmam.jpeg)\n\n---\n\n***Imagine Authors Cape Heartache***\n\n*Perfumer:* Josh Meyer\n\n*Enjoyability:* 9.2/10\n\n*Craftsmanship* ",
      "score": 103,
      "comments": 35,
      "url": "https://reddit.com/r/fragrance/comments/1bmahf2/blow_thou_winter_wind_more_shitty_reviews_for/",
      "created": "2024-03-24T02:51:59.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "If youre from a fragrance-free upbringing, how did you get into fragrance?",
      "text": "I grew up in a fragrance-free household (everything gave my mom headaches). Even with my grandparents, the closest thing I have to a scent memory is aftershave. None of my friends or SOs (save for the current one) have been particularly into fragrances.\n\nI was in a different sub a few months ago, I don't remember which one honestly. There was some string of comments talking about the nuance of fragrance, linking to this sub, and saying basically \"if you think the minimal knowledge I just dropped",
      "score": 82,
      "comments": 90,
      "url": "https://reddit.com/r/fragrance/comments/nm5lpa/if_youre_from_a_fragrancefree_upbringing_how_did/",
      "created": "2021-05-27T11:46:14.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "My taste in fragrances is getting \"cheaper\" with time",
      "text": "When I first started my fragrance journey. I was so obsessed with niche and expensive perfumes. The first 5 fragrances I ever bought with my own money were Creed. I never gave designers a chance. Brushed them all aside as chemical messes and kept saving for my next niche fragrance.\n  \nRecently I really started embracing the beauty in designer fragrances and honestly I've lost the interest in paying so much money on a niche fragrance. \n  \nI have 8 fragrances that cost over 400$ and if I go back I",
      "score": 71,
      "comments": 78,
      "url": "https://reddit.com/r/fragrance/comments/cweuuz/my_taste_in_fragrances_is_getting_cheaper_with/",
      "created": "2019-08-28T02:50:52.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "29M collection so far and hopes for the New Year",
      "text": "While I am a little bit behind the curve on this, I just wanted to post my collection now a week into 2021, and possibly where it might go in the future. For reference I'm 29, male, and based in the UK. Admittedly, I have already posted this in a way, but since I asked for a recommendation it was removed so I am sorry if this is your second time reading this. But here is an improved version with an image for Show &amp; Tell! \n\n[My collection thus far!](https://imgur.com/a/BoB4dlN).\n\n**Backstory:",
      "score": 93,
      "comments": 57,
      "url": "https://reddit.com/r/fragrance/comments/kt23di/29m_collection_so_far_and_hopes_for_the_new_year/",
      "created": "2021-01-08T13:06:28.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Happyland Studio Fragrance full house review",
      "text": "This one was a while in the making, and **it is very long. Buckle in.**\n\nBreaks will be provided (really!) but bring your own snacks. 🙃\n\nAs always, past reviews pinned at the top of my profile. Perhaps most of interest, fellow American indie houses Rogue Perfumery and Dame Perfumery.\n\n*****\n\nWho is **Happyland Studio**? Happyland is \"an American artisan perfumery based in Perrysburg, Ohio\" founded by E.J. Wells in 2019. A former musician who first rose to prominence in the 1970's punk scene, he",
      "score": 45,
      "comments": 12,
      "url": "https://reddit.com/r/fragrance/comments/1999cei/happyland_studio_fragrance_full_house_review/",
      "created": "2024-01-17T22:10:49.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Thoughts and reviews from a complete fragrance novice",
      "text": "I (29M) am about to turn 30 and thought it would be fun to pick out a \"signature scent\" to celebrate. I have absolutely no prior knowledge about fragrances, and the only time I have ever worn a scent was in high school (for a girl I was dating who liked a particular, very inexpensive fragrance). I'm not about to go to a crowded mall with everything going on right now, so I spent some time lurking on this sub trying to educate myself. I ordered samples of seven popular scents that sounded promisi",
      "score": 29,
      "comments": 33,
      "url": "https://reddit.com/r/fragrance/comments/rybr1f/thoughts_and_reviews_from_a_complete_fragrance/",
      "created": "2022-01-07T16:46:13.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "My (25M) Collection on Display",
      "text": "# About Me\n\nAt 25 I’ve been collecting for just over two(?) years since mid-pandemic. Bored at home I got deeply into sampling and decants, on a seemingly never ending search for the fabled “signature scent”. I started with the usual suspects—exploring the houses of TF, Creed, AdP, Dior, Chanel, Guerlain, etc.—but my tastes have expanded lots since then. Not many houses I haven’t at least sampled from these days, niche and designer both. Huge respect for lots of houses not mentioned.\n\nRecently I",
      "score": 67,
      "comments": 16,
      "url": "https://reddit.com/r/fragrance/comments/10coav2/my_25m_collection_on_display/",
      "created": "2023-01-15T16:42:58.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "fragrance",
      "title": "Aventus Cologne... Let's talk about this",
      "text": "Some of you may have heard that last year, it was revealed by Creed that they would be releasing a flanker to Creed Aventus called '[Aventus Cologne](https://fimgs.net/mdimg/secundar/o.57425.jpg).' I find it interesting that they've decided to release a cologne version of Aventus as it seems like a redundancy. The house already has so many super fresh releases such as SMW, VIW, MI, GIT, Neroli Sauvage, etc... While I am more than curious to see what this smells like, I don't think it has a place",
      "score": 43,
      "comments": 49,
      "url": "https://reddit.com/r/fragrance/comments/bhv3fr/aventus_cologne_lets_talk_about_this/",
      "created": "2019-04-27T03:32:23.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "SkincareAddiction",
      "title": "[PERSONAL] I was told this fits here better... are their other guys like me with so many products for their face/head, or am I just flat out neurotic?",
      "text": "I posted this in r/malegrooming the other day and was told it would fit in here, yet another sub I had no idea that it existed. \n\nHonestly I feel ridiculous sometimes, but it seems to work well. I’m Italo-American and have somewhat oily skin but also prone to dandruff, so I find my process to be helpful to maintain a balance as well as keep me looking younger. I started balding at 20, [despite my genetics claiming I should more likely have a glorious mane of thick, wavy brown hair,](https://imgu",
      "score": 5,
      "comments": 4,
      "url": "https://reddit.com/r/SkincareAddiction/comments/jajqmt/personal_i_was_told_this_fits_here_better_are/",
      "created": "2020-10-13T18:49:40.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "Looking for a perfume oil which has a great silage and longevity",
      "text": "Hey Everyone,\n\nI am looking for a perfume oil which has a great projection / silage and also has a great longevity. Most of the sub reddits I have checkout, most of those companies don't exist anymore or their website is hard to browse. \n\nI would really appreciate if you guys can post some links for some of the perfumes oil which has a great silage / longevity. Also would appreciate for any Canadian link since for me to ship from US is quite expensive. \n\nI would say I like more western fragrance",
      "score": 11,
      "comments": 13,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/1cvy2ei/looking_for_a_perfume_oil_which_has_a_great/",
      "created": "2024-05-19T20:52:02.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "Heavy/strange perfume recommendations?",
      "text": "Hi there, just came across this sub on google, was wondering if you all could recommend some interesting, unusual and strong perfumes.\n\nAt the moment I am using Juliette Has A Gun's Another Oud, Tom Ford's Tobacco Vanille and... Britney Spears' Fantasy. Yes, I know. I have used Creed's Aventus (love it, bored of it) and Penhaligon's Radcliff (loved it in London, not so much in Sydney, climates are a bitch) in the recent past as well for an overview of the sort of everyday scents I have a nose fo",
      "score": 12,
      "comments": 33,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/bnbwaq/heavystrange_perfume_recommendations/",
      "created": "2019-05-11T13:10:48.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "My first DIY perfume spray using perfume oil",
      "text": "Hey!\n\nStorytime, not needed for the rest: couple of weeks ago I started  looking for rep perfumes. People can't tell if it's a fake perfume  because they don't really see the bottles, right? So, started out with a  few local companies. Then check here and saw those from the ChezPierre guy, but still too expensive, not a lot of fragrances. I knew there had to be another level to it. And then I saw the light - perfume oils. There is this small but tight community in Fragrantica that has written 24",
      "score": 19,
      "comments": 13,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/ebfg1c/my_first_diy_perfume_spray_using_perfume_oil/",
      "created": "2019-12-16T13:57:14.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "Alcohol-based suggestions for my husband?",
      "text": "My husband has recently decreed that he wants more alcohol-based perfumes (specifically, in a spray bottle) because they are more convenient to apply. I've been collecting indie perfume for ages but most of my favorites are oil-based (this is also why most of his favorites up until this point have been BPAL) so this is not 100% within my realm of expertise! Here are some of his favorite scents:\n\n**BPAL Wilde** (*A sophisticated traditional gentleman’s cologne, with just the slightest taint of pa",
      "score": 13,
      "comments": 4,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/nlpsos/alcoholbased_suggestions_for_my_husband/",
      "created": "2021-05-26T19:49:51.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "Looking for a perfume oil which has a great silage and longevity",
      "text": "Hey Everyone,\n\nI am looking for a perfume oil which has a great projection / silage and also has a great longevity. Most of the sub reddits I have checkout, most of those companies don't exist anymore or their website is hard to browse. \n\nI would really appreciate if you guys can post some links for some of the perfumes oil which has a great silage / longevity. Also would appreciate for any Canadian link since for me to ship from US is quite expensive. \n\nI would say I like more western fragrance",
      "score": 8,
      "comments": 13,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/1cvy2ei/looking_for_a_perfume_oil_which_has_a_great/",
      "created": "2024-05-19T20:52:02.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "Heavy/strange perfume recommendations?",
      "text": "Hi there, just came across this sub on google, was wondering if you all could recommend some interesting, unusual and strong perfumes.\n\nAt the moment I am using Juliette Has A Gun's Another Oud, Tom Ford's Tobacco Vanille and... Britney Spears' Fantasy. Yes, I know. I have used Creed's Aventus (love it, bored of it) and Penhaligon's Radcliff (loved it in London, not so much in Sydney, climates are a bitch) in the recent past as well for an overview of the sort of everyday scents I have a nose fo",
      "score": 12,
      "comments": 33,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/bnbwaq/heavystrange_perfume_recommendations/",
      "created": "2019-05-11T13:10:48.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "My first DIY perfume spray using perfume oil",
      "text": "Hey!\n\nStorytime, not needed for the rest: couple of weeks ago I started  looking for rep perfumes. People can't tell if it's a fake perfume  because they don't really see the bottles, right? So, started out with a  few local companies. Then check here and saw those from the ChezPierre guy, but still too expensive, not a lot of fragrances. I knew there had to be another level to it. And then I saw the light - perfume oils. There is this small but tight community in Fragrantica that has written 24",
      "score": 17,
      "comments": 13,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/ebfg1c/my_first_diy_perfume_spray_using_perfume_oil/",
      "created": "2019-12-16T13:57:14.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "Alcohol-based suggestions for my husband?",
      "text": "My husband has recently decreed that he wants more alcohol-based perfumes (specifically, in a spray bottle) because they are more convenient to apply. I've been collecting indie perfume for ages but most of my favorites are oil-based (this is also why most of his favorites up until this point have been BPAL) so this is not 100% within my realm of expertise! Here are some of his favorite scents:\n\n**BPAL Wilde** (*A sophisticated traditional gentleman’s cologne, with just the slightest taint of pa",
      "score": 14,
      "comments": 4,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/nlpsos/alcoholbased_suggestions_for_my_husband/",
      "created": "2021-05-26T19:49:51.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "Looking for a perfume oil which has a great silage and longevity",
      "text": "Hey Everyone,\n\nI am looking for a perfume oil which has a great projection / silage and also has a great longevity. Most of the sub reddits I have checkout, most of those companies don't exist anymore or their website is hard to browse. \n\nI would really appreciate if you guys can post some links for some of the perfumes oil which has a great silage / longevity. Also would appreciate for any Canadian link since for me to ship from US is quite expensive. \n\nI would say I like more western fragrance",
      "score": 9,
      "comments": 13,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/1cvy2ei/looking_for_a_perfume_oil_which_has_a_great/",
      "created": "2024-05-19T20:52:02.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "Heavy/strange perfume recommendations?",
      "text": "Hi there, just came across this sub on google, was wondering if you all could recommend some interesting, unusual and strong perfumes.\n\nAt the moment I am using Juliette Has A Gun's Another Oud, Tom Ford's Tobacco Vanille and... Britney Spears' Fantasy. Yes, I know. I have used Creed's Aventus (love it, bored of it) and Penhaligon's Radcliff (loved it in London, not so much in Sydney, climates are a bitch) in the recent past as well for an overview of the sort of everyday scents I have a nose fo",
      "score": 10,
      "comments": 33,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/bnbwaq/heavystrange_perfume_recommendations/",
      "created": "2019-05-11T13:10:48.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "My first DIY perfume spray using perfume oil",
      "text": "Hey!\n\nStorytime, not needed for the rest: couple of weeks ago I started  looking for rep perfumes. People can't tell if it's a fake perfume  because they don't really see the bottles, right? So, started out with a  few local companies. Then check here and saw those from the ChezPierre guy, but still too expensive, not a lot of fragrances. I knew there had to be another level to it. And then I saw the light - perfume oils. There is this small but tight community in Fragrantica that has written 24",
      "score": 15,
      "comments": 13,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/ebfg1c/my_first_diy_perfume_spray_using_perfume_oil/",
      "created": "2019-12-16T13:57:14.000Z"
    },
    {
      "source": "reddit",
      "subreddit": "Indiemakeupandmore",
      "title": "Alcohol-based suggestions for my husband?",
      "text": "My husband has recently decreed that he wants more alcohol-based perfumes (specifically, in a spray bottle) because they are more convenient to apply. I've been collecting indie perfume for ages but most of my favorites are oil-based (this is also why most of his favorites up until this point have been BPAL) so this is not 100% within my realm of expertise! Here are some of his favorite scents:\n\n**BPAL Wilde** (*A sophisticated traditional gentleman’s cologne, with just the slightest taint of pa",
      "score": 14,
      "comments": 4,
      "url": "https://reddit.com/r/Indiemakeupandmore/comments/nlpsos/alcoholbased_suggestions_for_my_husband/",
      "created": "2021-05-26T19:49:51.000Z"
    },
    {
      "source": "Temptalia",
      "url": "https://www.temptalia.com/?s=Creed%20Aventus%20dupe",
      "mentions": [
        "dupe | Temptalia",
        "Dupes to Help You Shop Smarter",
        "dupe | Temptalia",
        "Dupes to Help You Shop Smarter",
        "Dupes to Help You Shop Smarter",
        "dupe | Temptalia",
        "Dupes to Help You Shop Smarter",
        "Dupes to Help You Shop Smarter",
        "dupes, plus what you need to know about new product launches and tips on how to use your makeup",
        "dupe\",\"name"
      ]
    },
    {
      "source": "Fragrantica",
      "url": "https://www.fragrantica.com/search/?query=Creed%20Aventus",
      "mentions": []
    }
  ],
  "googleSuggestions": [
    "creed aventus dupe",
    "creed aventus dupe reddit",
    "creed aventus dupe for men",
    "creed aventus dupe lattafa",
    "creed aventus dupe cologne",
    "creed aventus dupe amazon",
    "creed aventus dupe club de nuit",
    "creed aventus dupe zara",
    "creed aventus dupe afnan",
    "creed aventus dupe armaf",
    "creed aventus alternative",
    "creed aventus alternative reddit",
    "creed aventus alternative zara",
    "creed aventus alternative perfume",
    "creed aventus alternative in pakistan",
    "creed aventus alternative india",
    "creed aventus alternative philippines",
    "creed aventus alternative name",
    "creed aventus alternative lattafa",
    "creed perfume alternative",
    "creed aventus cheaper version",
    "creed aventus cheap version",
    "creed aventus cheaper alternative",
    "creed aventus cheap alternative reddit",
    "cheapest creed aventus",
    "which creed aventus is the best",
    "is creed aventus worth it",
    "why is creed aventus so expensive",
    "best dupe for creed aventus",
    "best dupe for creed aventus for her",
    "best dupe for creed aventus absolu",
    "best dupe for creed aventus reddit",
    "best dupe for creed aventus cologne",
    "best dupe men's cologne for creed aventus",
    "best duplicate of creed aventus",
    "best creed aventus for her dupe reddit",
    "cheapest place to buy creed aventus"
  ]
}